In [7]:
import pandas as pd 
import numpy as np

In [14]:
exam_data = {
'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],

'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],

'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],

'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [15]:
df = pd.DataFrame(data = exam_data, index = labels)

In [17]:
df.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [19]:
df[['name','score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [23]:
df.loc['k'] =["Suresh",15.5, 1, "yes"]

In [33]:
df =df.drop(labels='attempts',axis = 1)

In [36]:
df['Success'] = df['score'].apply(lambda x: 1 if x> 10 else 0)

In [37]:
df

        name  score qualify  Success
a  Anastasia   12.5     yes        1
b       Dima    9.0      no        0
c  Katherine   16.5     yes        1
d      James    NaN      no        0
e      Emily    9.0      no        0
f    Michael   20.0     yes        1
g    Matthew   14.5     yes        1
h      Laura    NaN      no        0
i      Kevin    8.0      no        0
j      Jonas   19.0     yes        1
k     Suresh   15.5     yes        1

In [44]:
df.to_csv()

',name,score,qualify,Success\r\na,Anastasia,12.5,yes,1\r\nb,Dima,9.0,no,0\r\nc,Katherine,16.5,yes,1\r\nd,James,,no,0\r\ne,Emily,9.0,no,0\r\nf,Michael,20.0,yes,1\r\ng,Matthew,14.5,yes,1\r\nh,Laura,,no,0\r\ni,Kevin,8.0,no,0\r\nj,Jonas,19.0,yes,1\r\nk,Suresh,15.5,yes,1\r\n'